simpleFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    // coordinates of the outer domain
    (-10.5 -0.025587 0)
    (-0.15757 10.3168 0)
    (0.5 10.3168 0)
    (20.5 10.3168 0)
    (20.5 -0.024725 0)
    (20.5 -10.0732 0)
    (0.5 -10.0732 0)
    (-0.45239 -10.0732 0)
    // Airfoil key coordinates
    (-0.5 -0.025587 0)
    (-0.15757 0.084988 0)
    (0.5 -0.024725 0)
    (-0.45239 -0.058282 0)
    // ************************************************ // 
    // coordinates of the outer domain
    (-10.5 -0.025587 1)
    (-0.15757 10.3168 1)
    (0.5 10.3168 1)
    (20.5 10.3168 1)
    (20.5 -0.024725 1)
    (20.5 -10.0732 1)
    (0.5 -10.0732 1)
    (-0.45239 -10.0732 1)
    // Airfoil key coordinates
    (-0.5 -0.025587 1)
    (-0.15757 0.084988 1)
    (0.5 -0.024725 1)
    (-0.45239 -0.058282 1)
);

blocks
(
    hex (8 9 1 0 20 21 13 12) (40 100 1) simpleGrading (1 50 1)
    hex (9 10 2 1 21 22 14 13) (40 100 1) simpleGrading (1 50 1)
    hex (10 4 3 2 22 16 15 14) (200 100 1) simpleGrading (20 50 1)
    
    hex (11 8 0 7 23 20 12 19) (40 100 1) simpleGrading (1 50 1)
    hex (10 11 7 6 22 23 19 18) (60 100 1) simpleGrading (1 50 1)
    hex (4 10 6 5 16 22 18 17) (200 100 1) simpleGrading (0.05 50 1)
);

edges
(
    // Arc for the front
    arc 0 1 (-6.8056 7.8972 0)
    arc 12 13 (-6.8056 7.8972 1)
    arc 0 7 (-8.1493 -6.4841 0)
    arc 12 19 (-8.1493 -6.4841 1)
    // Define airfoil top-front surface // 
    spline 8 9
    (
        (-0.49981 -0.019425 0)
        (-0.4979 -0.013028 0)
        (-0.49431 -0.0064486 0)
        (-0.48904 0.00025867 0)
        (-0.48212 0.0070392 0)
        (-0.4736 0.013838 0)
        (-0.46351 0.020599 0)
        (-0.45188 0.027267 0)
        (-0.43875 0.03379 0)
        (-0.42419 0.040115 0)
        (-0.40822 0.04619 0)
        (-0.39091 0.051968 0)
        (-0.37231 0.057403 0)
        (-0.35248 0.062451 0)
        (-0.33148 0.067074 0)
        (-0.30938 0.071234 0)
        (-0.28624 0.0749 0)
        (-0.26214 0.078044 0)
        (-0.23715 0.080641 0)
        (-0.21133 0.082673 0)
        (-0.18478 0.084125 0)
    )
    spline 20 21
    (
        (-0.49981 -0.019425 1)
        (-0.4979 -0.013028 1)
        (-0.49431 -0.0064486 1)
        (-0.48904 0.00025867 1)
        (-0.48212 0.0070392 1)
        (-0.4736 0.013838 1)
        (-0.46351 0.020599 1)
        (-0.45188 0.027267 1)
        (-0.43875 0.03379 1)
        (-0.42419 0.040115 1)
        (-0.40822 0.04619 1)
        (-0.39091 0.051968 1)
        (-0.37231 0.057403 1)
        (-0.35248 0.062451 1)
        (-0.33148 0.067074 1)
        (-0.30938 0.071234 1)
        (-0.28624 0.0749 1)
        (-0.26214 0.078044 1)
        (-0.23715 0.080641 1)
        (-0.21133 0.082673 1)
        (-0.18478 0.084125 1)
    )
    // Define airfoil top-back surface // 
    spline 9 10
    (
        (-0.12978 0.085258 0)
        (-0.10149 0.084935 0)
        (-0.0728 0.084025 0)
        (-0.043786 0.082541 0)
        (-0.01454 0.080498 0)
        (0.014845 0.077919 0)
        (0.044278 0.074831 0)
        (0.073664 0.071266 0)
        (0.10291 0.067263 0)
        (0.13191 0.062862 0)
        (0.16057 0.05811 0)
        (0.18879 0.053058 0)
        (0.21647 0.047759 0)
        (0.2435 0.04227 0)
        (0.26978 0.036651 0)
        (0.2952 0.030963 0)
        (0.31965 0.025268 0)
        (0.34303 0.01963 0)
        (0.36523 0.01411 0)
        (0.38612 0.0087689 0)
        (0.40561 0.0036649 0)
        (0.42358 -0.001148 0)
        (0.43993 -0.0056201 0)
        (0.45453 -0.0097078 0)
        (0.46729 -0.013375 0)
        (0.4781 -0.016592 0)
        (0.48686 -0.01934 0)
        (0.49349 -0.021609 0)
        (0.49789 -0.023401 0)
    )
    spline 21 22
    (
        (-0.12978 0.085258 1)
        (-0.10149 0.084935 1)
        (-0.0728 0.084025 1)
        (-0.043786 0.082541 1)
        (-0.01454 0.080498 1)
        (0.014845 0.077919 1)
        (0.044278 0.074831 1)
        (0.073664 0.071266 1)
        (0.10291 0.067263 1)
        (0.13191 0.062862 1)
        (0.16057 0.05811 1)
        (0.18879 0.053058 1)
        (0.21647 0.047759 1)
        (0.2435 0.04227 1)
        (0.26978 0.036651 1)
        (0.2952 0.030963 1)
        (0.31965 0.025268 1)
        (0.34303 0.01963 1)
        (0.36523 0.01411 1)
        (0.38612 0.0087689 1)
        (0.40561 0.0036649 1)
        (0.42358 -0.001148 1)
        (0.43993 -0.0056201 1)
        (0.45453 -0.0097078 1)
        (0.46729 -0.013375 1)
        (0.4781 -0.016592 1)
        (0.48686 -0.01934 1)
        (0.49349 -0.021609 1)
        (0.49789 -0.023401 1)
    )
    // Define airfoil bottom-front surface // 
    spline 8 11
    (
        (-0.49846 -0.031464 0)
        (-0.49517 -0.037007 0)
        (-0.49013 -0.042172 0)
        (-0.48333 -0.046917 0)
        (-0.47477 -0.051205 0)
        (-0.46445 -0.055002 0)
    )
    spline 20 23
    (
        (-0.49846 -0.031464 1)
        (-0.49517 -0.037007 1)
        (-0.49013 -0.042172 1)
        (-0.48333 -0.046917 1)
        (-0.47477 -0.051205 1)
        (-0.46445 -0.055002 1)
    )
    // Define airfoil bottom-back surface // 
    spline 11 10
    (
        (-0.43859 -0.061022 0)
        (-0.42308 -0.063207 0)
        (-0.40588 -0.064827 0)
        (-0.38702 -0.065881 0)
        (-0.36653 -0.066372 0)
        (-0.34446 -0.066315 0)
        (-0.32086 -0.06573 0)
        (-0.29578 -0.064643 0)
        (-0.2693 -0.063092 0)
        (-0.24148 -0.061119 0)
        (-0.21242 -0.058774 0)
        (-0.18221 -0.056113 0)
        (-0.15095 -0.053197 0)
        (-0.11876 -0.050093 0)
        (-0.08578 -0.046869 0)
        (-0.052137 -0.043595 0)
        (-0.017988 -0.040343 0)
        (0.016505 -0.037183 0)
        (0.051167 -0.034178 0)
        (0.085817 -0.031391 0)
        (0.12026 -0.028874 0)
        (0.15431 -0.026671 0)
        (0.18775 -0.024816 0)
        (0.22039 -0.023332 0)
        (0.25201 -0.022229 0)
        (0.28244 -0.021501 0)
        (0.31146 -0.021134 0)
        (0.33889 -0.021096 0)
        (0.36458 -0.021348 0)
        (0.38835 -0.021836 0)
        (0.41007 -0.022499 0)
        (0.42962 -0.02327 0)
        (0.44689 -0.024077 0)
        (0.46181 -0.024844 0)
        (0.47432 -0.025497 0)
        (0.48437 -0.025963 0)
        (0.49196 -0.026176 0)
        (0.49708 -0.026075 0)
        (0.49974 -0.025605 0)
    )
    spline 23 22
    (
        (-0.43859 -0.061022 1)
        (-0.42308 -0.063207 1)
        (-0.40588 -0.064827 1)
        (-0.38702 -0.065881 1)
        (-0.36653 -0.066372 1)
        (-0.34446 -0.066315 1)
        (-0.32086 -0.06573 1)
        (-0.29578 -0.064643 1)
        (-0.2693 -0.063092 1)
        (-0.24148 -0.061119 1)
        (-0.21242 -0.058774 1)
        (-0.18221 -0.056113 1)
        (-0.15095 -0.053197 1)
        (-0.11876 -0.050093 1)
        (-0.08578 -0.046869 1)
        (-0.052137 -0.043595 1)
        (-0.017988 -0.040343 1)
        (0.016505 -0.037183 1)
        (0.051167 -0.034178 1)
        (0.085817 -0.031391 1)
        (0.12026 -0.028874 1)
        (0.15431 -0.026671 1)
        (0.18775 -0.024816 1)
        (0.22039 -0.023332 1)
        (0.25201 -0.022229 1)
        (0.28244 -0.021501 1)
        (0.31146 -0.021134 1)
        (0.33889 -0.021096 1)
        (0.36458 -0.021348 1)
        (0.38835 -0.021836 1)
        (0.41007 -0.022499 1)
        (0.42962 -0.02327 1)
        (0.44689 -0.024077 1)
        (0.46181 -0.024844 1)
        (0.47432 -0.025497 1)
        (0.48437 -0.025963 1)
        (0.49196 -0.026176 1)
        (0.49708 -0.026075 1)
        (0.49974 -0.025605 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (0 7 19 12)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 4 16 15)
            (4 5 17 16)
        );
    }
    
    airfoil
    {
        type wall;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (8 11 23 20)
            (11 10 22 23)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (1 2 14 13)
            (2 3 15 14)
            (7 6 18 19)
            (6 5 17 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
